export default {
    phone: {
        digit: /^1[3-9]\d{9}$/,
        yd: /^1(3[4-9]|5[012789]|8[78])\d{8}$/,
        dx: /^18[09]\d{8}$/,
        lt: /1/,
        all: /^((\+|00)86)?((134\d{4})|((13[0-3|5-9]|14[1|5-9]|15[0-9]|16[2|5-7]|17[0-8]|18[0-9]|19[0-2|5-9])\d{8}))$/
    },
    telephone: /^((0\d{2,3})-)(\d{7,8})(-(\d{3,}))?$/,
    password: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)[^]{8,16}$/, // 密码校验   至少包含大写字母，小写字母，数字 不少于8位
    contact: /^((0\d{2,3}\d{7,8})|(1\d{10}))$/,
    idCard: {
        15: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0-2]\d)|3[0-1])\d{3}$/,
        18: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0-2]\d)|3[0-1])\d{4}$/,
        all: /^[1-9][0-9]{5}([1][9][0-9]{2}|[2][0][0|1][0-9])([0][1-9]|[1][0|12])([0][1-9]|[1|2][0-9]|[3][0|1])[0-9]{3}([0-9]|[X|x])$/,
        digit: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/
    },
    email: {
        one: /^[A-Za-z0-9._%-]+@([A-Za-z0-9-]+\.)+[A-Za-z]{2,4}$/,
        two: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
    },
    name: {
        normal: /^[\u4e00-\u9fa5]{2,8}$/, // 正常的人名限制  2-8位
        normal2: /^[\u4E00-\u9FA5\uf900-\ufa2d·s]{2,20}$/, // 2-20 少数民族 + 汉族
    },
    text: {
        normal: /\s*/,
    },

    autoCityRe: /^([杭湖衢台温]州|宁波|绍兴|嘉兴|金华|丽水|舟山)市$/,
    cityDictReg: {
        330000: {
            reg: /([杭湖衢台温]州|宁波|绍兴|嘉兴|金华|丽水|舟山)/,
            value: "浙江省"
        },
        350000: {
            /*
            *
            * 福州|厦门|泉州|莆田|漳州|宁德|南平|三明|龙岩
            *
            * */
            reg: /([福|泉]州|厦门|莆田|漳州|宁德|南平|三明|龙岩)/,
            value: "福建省"
        },
        /*
        *
        * 郑州|开封|洛阳|平顶山|焦作|鹤壁|新乡|安阳|濮阳|许昌|漯河|三门峡|南阳|商丘|信阳|周口|驻马店|济源
        * */
        410000: {
            reg: /([洛濮安]阳|郑州|开封|平顶山|焦作|鹤壁|新乡|许昌|漯河|三门峡|南阳|商丘|信阳|周口|驻马店|济源)/,
            value: "河南省"
        },
        /*
        *
        * 太原|大同|阳泉|长治|晋城|朔州|晋中|运城|忻州|临汾|吕梁
        * */
        140000: {
            reg: /(晋[中城]|太原|大同|阳泉|长治|朔州|运城|忻州|临汾|吕梁)/,
            value: "山西省"
        },
        /*
        *
        * 济南|青岛|淄博|枣庄|东营|烟台|潍坊|济宁|泰安|威海|日照|滨州|德州|聊城|临沂|菏泽|莱芜
        * */
        370000: {
            reg: /([滨德]州|济南|青岛|淄博|枣庄|东营|烟台|潍坊|济宁|泰安|威海|日照|聊城|临沂|菏泽|莱芜)/,
            value: "山东省"
        },
        /*
        *
        * 南京|无锡|徐州|常州|苏州|南通|连云港|淮安|扬州|镇江|泰州|宿迁
        * */
        320000: {
            reg: /([徐苏扬泰常]州|南京|无锡|南通|连云港|淮安|镇江|宿迁)/,
            value: "江苏省"
        },

        /*
        * 西安|铜川|宝鸡|咸阳|渭南|汉中|安康|商洛|延安|榆林
        * */
        610000: {
            reg: /(西安|铜川|宝鸡|咸阳|渭南|汉中|安康|商洛|榆林)/,
            value: "陕西省"
        },
        /*

        '昆明',         '曲靖',
          '玉溪',         '保山',
          '昭通',         '丽江',
          '普洱',         '临沧',
          '', '怒江傈僳族自治州',
          '迪庆藏族自治州',    '大理白族自治州',
          '楚雄彝族自治州',    '红河哈尼族彝族自治州',
          '文山壮族苗族自治州',  '西双版纳傣族自治州',
        * */
        530100: {
            reg: /([德宏傣族景颇|迪庆藏|大理白|楚雄彝|红河哈尼族彝|文山壮族苗|西双版纳傣]族自治州|昆明|曲靖|玉溪|保山|昭通|丽江|普洱|临沧)/,
            value: "云南省"
        }
    },
    bss3order: {
        order7: /^(7[0-9]|80)\d{19}$/,
        fjorder: /^FJ\d{16}$/,
        all: /^(7[0-9]|80)\d{19}$|^FJ\d{16}$/
    }
}
